liquidraver/MeshCore/src/helpers/nrf52/SerialBLEInterface.cpp
void SerialBLEInterface::begin(const char* device_name, uint32_t pin_code) {

  instance = this;

  char charpin[20];
  sprintf(charpin, "%d", pin_code);

  Bluefruit.autoConnLed(false);
  Bluefruit.configPrphBandwidth(BANDWIDTH_MAX);
  Bluefruit.begin();
  Bluefruit.setTxPower(BLE_TX_POWER);
  Bluefruit.setName(device_name);

  Bluefruit.Security.setMITM(true);
  Bluefruit.Security.setPIN(charpin);
  Bluefruit.Security.setIOCaps(true, false, false);
  Bluefruit.Security.setPairPasskeyCallback(onPairingPasskey);
  Bluefruit.Security.setPairCompleteCallback(onPairingComplete);

  Bluefruit.Periph.setConnectCallback(onConnect);
  Bluefruit.Periph.setDisconnectCallback(onDisconnect);
  Bluefruit.Security.setSecuredCallback(onSecured);

  Bluefruit.setEventCallback(onBLEEvent);

  bleuart.setPermission(SECMODE_ENC_WITH_MITM, SECMODE_ENC_WITH_MITM);
  bleuart.begin();

  Bluefruit.Advertising.stop();
  Bluefruit.Advertising.clearData();
  Bluefruit.ScanResponse.clearData();

  Bluefruit.Advertising.addFlags(BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE);
  Bluefruit.Advertising.addTxPower();

  Bluefruit.Advertising.addService(bleuart);

  Bluefruit.ScanResponse.addName();

  Bluefruit.Advertising.restartOnDisconnect(true);
  Bluefruit.Advertising.setInterval(32, 244);
  Bluefruit.Advertising.setFastTimeout(30);

}

void SerialBLEInterface::startAdv() {
  BLE_DEBUG_PRINTLN("SerialBLEInterface: starting advertising");

  if(Bluefruit.Advertising.isRunning()){
    BLE_DEBUG_PRINTLN("SerialBLEInterface: already advertising");
    return;
  }

  Bluefruit.Advertising.start(0);
}

void SerialBLEInterface::stopAdv() {

  BLE_DEBUG_PRINTLN("SerialBLEInterface: stopping advertising");
  
  if(!Bluefruit.Advertising.isRunning()){
    return;
  }

  Bluefruit.Advertising.stop();

}

void SerialBLEInterface::enable() {
  if (_isEnabled) return;

  _isEnabled = true;
  clearBuffers();

  Bluefruit.Advertising.restartOnDisconnect(true);
  startAdv();
}

void SerialBLEInterface::disconnect() {
  uint8_t connection_num = Bluefruit.connected();
  if (connection_num) {
    for (uint8_t i = 0; i < connection_num; i++) {
      Bluefruit.disconnect(i);
    }
    while (Bluefruit.connected()) {
      yield();
    }
    BLE_DEBUG_PRINTLN("SerialBLEInterface: disconnect completed");
  }
}

void SerialBLEInterface::disable() {
  _isEnabled = false;
  BLE_DEBUG_PRINTLN("SerialBLEInterface: disable");

  disconnect();

  Bluefruit.Advertising.restartOnDisconnect(false);
  stopAdv();
}

size_t SerialBLEInterface::writeFrame(const uint8_t src[], size_t len) {
  if (len > MAX_FRAME_SIZE) {
    BLE_DEBUG_PRINTLN("writeFrame(), frame too big, len=%d", len);
    return 0;
  }

  if (isConnected() && len > 0) {
    if (send_queue_len >= FRAME_QUEUE_SIZE) {
      BLE_DEBUG_PRINTLN("writeFrame(), send_queue is full!");
      return 0;
    }

    send_queue[send_queue_len].len = len;
    memcpy(send_queue[send_queue_len].buf, src, len);
    send_queue_len++;

    return len;
  }
  return 0;
}

bool SerialBLEInterface::isWriteBusy() const {
  return _pending_writes >= MAX_PENDING_WRITES;
}

size_t SerialBLEInterface::checkRecvFrame(uint8_t dest[]) {
  // Check for disconnect event timeout - if we initiated a disconnect but event didn't arrive
  if (_disconnect_pending && _disconnect_initiated_time > 0) {
    unsigned long time_since_disconnect = millis() - _disconnect_initiated_time;
    if (time_since_disconnect >= DISCONNECT_EVENT_TIMEOUT) {
      BLE_DEBUG_PRINTLN("Disconnect event timeout - assuming disconnected after %d ms", 
                       (uint32_t)time_since_disconnect);
      // Disconnect event didn't arrive - assume we're disconnected
      _isDeviceConnected = false;
      _connectionHandle = 0xFFFF;
      _disconnect_pending = false;
      _disconnect_initiated_time = 0;
      _disconnect_waiting_tx_drain = false;
      _tx_drain_wait_start = 0;
      _last_disconnect_time = millis();
      send_queue_len = 0;
      _pending_writes = 0;
      _write_retry_count = 0;
      _first_write_failure_time = 0;
    }
  }
  
  // Check if we're waiting for TX queue to drain before forcing disconnect
  if (_disconnect_waiting_tx_drain && _tx_drain_wait_start > 0) {
    if (_pending_writes == 0) {
      // TX queue is empty, proceed with disconnect immediately
      BLE_DEBUG_PRINTLN("TX queue drained, proceeding with forced disconnect");
      _disconnect_waiting_tx_drain = false;
      _tx_drain_wait_start = 0;
      // Proceed with disconnect if connection is valid and rate limit allows
      if (isConnectionHandleValid()) {
        unsigned long time_since_last_disconnect = millis() - _last_disconnect_time;
        if (time_since_last_disconnect >= MIN_DISCONNECT_INTERVAL) {
          uint32_t err = sd_ble_gap_disconnect(_connectionHandle, BLE_HCI_LOCAL_HOST_TERMINATED_CONNECTION);
          if (err == NRF_SUCCESS) {
            _disconnect_initiated_time = millis();
            _disconnect_pending = true;
            BLE_DEBUG_PRINTLN("Disconnect initiated after TX drain, waiting for event");
          } else if (err == NRF_ERROR_NO_MEM) {
            BLE_DEBUG_PRINTLN("NRF_ERROR_NO_MEM after TX drain - SoftDevice out of memory, clearing state");
            _isDeviceConnected = false;
            _connectionHandle = 0xFFFF;
            _disconnect_pending = false;
            _disconnect_initiated_time = 0;
            _last_disconnect_time = millis();
            send_queue_len = 0;
            _pending_writes = 0;
            _write_retry_count = 0;
            _first_write_failure_time = 0;
          } else {
            BLE_DEBUG_PRINTLN("Disconnect failed after TX drain with error: 0x%08X", (uint32_t)err);
            _isDeviceConnected = false;
            _connectionHandle = 0xFFFF;
          }
        } else {
          BLE_DEBUG_PRINTLN("Disconnect rate limited after TX drain - waiting %d ms", 
                           (uint32_t)(MIN_DISCONNECT_INTERVAL - time_since_last_disconnect));
          _isDeviceConnected = false;
        }
      } else {
        // Invalid handle, just clear state
        _isDeviceConnected = false;
        _connectionHandle = 0xFFFF;
      }
    } else {
      // Still waiting for TX queue to drain - check timeout
      unsigned long time_waiting = millis() - _tx_drain_wait_start;
      if (time_waiting >= TX_QUEUE_DRAIN_TIMEOUT) {
        BLE_DEBUG_PRINTLN("TX queue drain timeout after %d ms (pending=%d), forcing disconnect anyway", 
                         (uint32_t)time_waiting, _pending_writes);
        _disconnect_waiting_tx_drain = false;
        _tx_drain_wait_start = 0;
        // Proceed with disconnect if connection is valid and rate limit allows
        if (isConnectionHandleValid()) {
          unsigned long time_since_last_disconnect = millis() - _last_disconnect_time;
          if (time_since_last_disconnect >= MIN_DISCONNECT_INTERVAL) {
            uint32_t err = sd_ble_gap_disconnect(_connectionHandle, BLE_HCI_LOCAL_HOST_TERMINATED_CONNECTION);
            if (err == NRF_SUCCESS) {
              _disconnect_initiated_time = millis();
              _disconnect_pending = true;
              BLE_DEBUG_PRINTLN("Disconnect initiated after TX drain timeout, waiting for event");
            } else if (err == NRF_ERROR_NO_MEM) {
              BLE_DEBUG_PRINTLN("NRF_ERROR_NO_MEM after TX drain timeout - SoftDevice out of memory, clearing state");
              _isDeviceConnected = false;
              _connectionHandle = 0xFFFF;
              _disconnect_pending = false;
              _disconnect_initiated_time = 0;
              _last_disconnect_time = millis();
              send_queue_len = 0;
              _pending_writes = 0;
              _write_retry_count = 0;
              _first_write_failure_time = 0;
            } else {
              BLE_DEBUG_PRINTLN("Disconnect failed after TX drain timeout with error: 0x%08X", (uint32_t)err);
              _isDeviceConnected = false;
              _connectionHandle = 0xFFFF;
            }
          } else {
            BLE_DEBUG_PRINTLN("Disconnect rate limited after TX drain timeout - waiting %d ms", 
                             (uint32_t)(MIN_DISCONNECT_INTERVAL - time_since_last_disconnect));
            _isDeviceConnected = false;
          }
        } else {
          // Invalid handle, just clear state
          _isDeviceConnected = false;
          _connectionHandle = 0xFFFF;
        }
      } else {
        // Still waiting, don't proceed with disconnect yet
        BLE_DEBUG_PRINTLN("Waiting for TX queue to drain: pending=%d, waited=%d ms", 
                         _pending_writes, (uint32_t)time_waiting);
        // Don't return early - still process RX and other operations
      }
    }
  }
  
  if (send_queue_len > 0 && _pending_writes < MAX_PENDING_WRITES) {
    if (_isDeviceConnected && isConnectionHandleValid() && bleuart.notifyEnabled(_connectionHandle)) {
      size_t written = bleuart.write(send_queue[0].buf, send_queue[0].len);
      if (written > 0) {
        _pending_writes++;
        _write_retry_count = 0;  // Reset retry counter on success
        _first_write_failure_time = 0;  // Reset failure timer on success
        BLE_DEBUG_PRINTLN("writeBytes: sz=%d, hdr=%d, pending=%d",
                         (uint32_t)send_queue[0].len, (uint32_t)send_queue[0].buf[0],
                         _pending_writes);

        send_queue_len--;
        for (int i = 0; i < send_queue_len; i++) {
          send_queue[i] = send_queue[i + 1];
        }
      } else {
        // Track when write failures started
        if (_first_write_failure_time == 0) {
          _first_write_failure_time = millis();
        }
        
        _write_retry_count++;
        BLE_DEBUG_PRINTLN("writeBytes failed, retry=%d, pending=%d", _write_retry_count, _pending_writes);
        
